# Clash Bot Workflow PR Details

## Lambda Function Versions used

| Lambda Function | Artifact Version |
| --------------- | ---------------- |
| Event Publisher | 187 |
| Event Handler | 191 |
| Event Notifier | 192 |
| Create Team | 187 |
| Retrieve Teams | 187 |
| Is Tournament Eligible | 188 |

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_handler_exec_role-development]
data.aws_acm_certificate.issued: Reading...
aws_apigatewayv2_api.clash_bot_websocket_api: Refreshing state... [id=k10wm04op6]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=retrieve_team_exec_role-development]
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=tournament_eligibility_exec_role-development]
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_publisher_exec_role-development]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.events_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-events-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.event_notifier_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_notifier_exec_role-development]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.create_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create_team_exec_role-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.event_notifier_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.retrieve_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-team-Policy-development]
module.event_notifier_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-notifier-development]
module.create_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-Policy-development]
module.retrieve_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=retrieve-team-development]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.tournament_eligibility_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/tournament-eligibility-Policy-development]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Refreshing state... [id=tournament-eligibility-development]
module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_notifier_exec_role-development-20231119090315299300000001]
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=create_team_exec_role-development-20231118000957795600000001]
module.create_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-team-development]
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=retrieve_team_exec_role-development-20231118000958206700000003]
module.event_publisher_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-publisher-Policy-development]
module.event_publisher_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-publisher-development]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=tournament_eligibility_exec_role-development-20231118000958741200000004]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_publisher_exec_role-development-20231118000957978600000002]
aws_apigatewayv2_integration.clash_bot_websocket_api_integration: Refreshing state... [id=dczcm2o]
aws_lambda_permission.clash_bot_ws_lambda_permission: Refreshing state... [id=terraform-20231119090321485100000002]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Read complete after 0s [id=2997044669]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
module.create_team_step_function.aws_iam_policy.service["lambda"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-lambda]
aws_apigatewayv2_route.clash_bot_connection_route: Refreshing state... [id=w7fedob]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
module.create_team_step_function.aws_iam_policy_attachment.service["lambda"]: Refreshing state... [id=create-team-development-lambda]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]
aws_lambda_permission.tournament_eligibility_permission: Refreshing state... [id=TournamentEligibilityPermission-development]
aws_lambda_permission.create_team_permission: Refreshing state... [id=CreateTeamPermission-development]
module.event_handler_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-handler-Policy-development]
module.event_handler_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-handler-development]
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_handler_exec_role-development-20231118001013189900000005]
aws_lambda_event_source_mapping.event_handler_sqs_trigger: Refreshing state... [id=7fd6c898-c397-49fa-b143-76747922a919]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_deployment.clash_bot_websocket_api_deployment will be created
  + resource "aws_apigatewayv2_deployment" "clash_bot_websocket_api_deployment" {
      + api_id        = "k10wm04op6"
      + auto_deployed = (known after apply)
      + description   = "Webscocket API deployment"
      + id            = (known after apply)
    }

  # aws_apigatewayv2_stage.clash_bot_websocket_api_stage will be created
  + resource "aws_apigatewayv2_stage" "clash_bot_websocket_api_stage" {
      + api_id        = "k10wm04op6"
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + description   = "Clash Bot Workflow Websocket API stage"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "events-development"
      + tags_all      = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_apigatewayv2_deployment.clash_bot_websocket_api_deployment: Creating...
aws_apigatewayv2_deployment.clash_bot_websocket_api_deployment: Creation complete after 0s [id=j94cin]
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Creating...
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Creation complete after 1s [id=events-development]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
create-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-handler-development"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-publisher-development"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
retrieve-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:retrieve-team-development"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
tournament-eligibility-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*